FOM/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

turbulentKE          37;
turbulentOmega       32;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    inlet
    {
        type  fixedValue;
        value $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    top
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    bottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "(sides)"
    {
        type slip;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
